/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lwip_hook.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2017 年 05 月 12 日
**
** 描        述: lwip SylixOS HOOK.
*********************************************************************************************************/

#ifndef __LWIP_HOOK_H
#define __LWIP_HOOK_H

#include "lwip/pbuf.h"
#include "lwip/netif.h"

/*********************************************************************************************************
  数据包类型
*********************************************************************************************************/

#define IP_HOOK_V4      4
#define IP_HOOK_V6      6

/*********************************************************************************************************
  回调类型
  
                                               TCP/IP stack  
                                         ^                     |
                                         |                     |
                                         |                     \/
                                     [LOCAL_IN]           [LOCAL_OUT] ???
                                         ^                     |
                                         |                     |
                                         |                route output
                                         |                     |
                                         |                     |
                                         |                     \/
  packet input --> [PRE_ROUTING] --> route input --> [FORWARD] --> [POST_ROUTING] --> packet output 
  
*********************************************************************************************************/

#define IP_HT_PRE_ROUTING       0
#define IP_HT_LOCAL_IN          1
#define IP_HT_FORWARD           2
#define IP_HT_LOCAL_OUT         3                                       /*  TODO: not support now!      */
#define IP_HT_POST_ROUTING      4

/*********************************************************************************************************
  内核函数 
  
  出于兼容性考虑, 以下函数只能在 BSP 或者内核静态库中使用, 严禁动态加载的内核模块使用以下函数安装 HOOK.
*********************************************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif                                                                  /*  __cplusplus                 */

int  net_ip_hook_add(const char *name, int (*hook)(int ip_type, int hook_type, struct pbuf *p, 
                                                   struct netif *in, struct netif *out));
int  net_ip_hook_delete(int (*hook)(int ip_type, int hook_type, struct pbuf *p, 
                                    struct netif *in, struct netif *out));

#ifdef __cplusplus
}
#endif                                                                  /*  __cplusplus                 */

#endif                                                                  /*  __LWIP_HOOK_H               */
/*********************************************************************************************************
  END
*********************************************************************************************************/
