/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: bspLib.c
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2016 年 7 月 31 日
**
** 描        述: 处理器需要为 SylixOS 提供的功能支持.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
#include "arch/x86/asm/hwcap.h"
#include "arch/x86/common/x86CpuId.h"
#include "arch/x86/acpi/x86AcpiLib.h"
/*********************************************************************************************************
** 函数名称: bspInfoCpu
** 功能描述: BSP CPU 信息
** 输　入  : NONE
** 输　出  : CPU 信息
** 全局变量:
** 调用模块:
*********************************************************************************************************/
LW_WEAK CPCHAR  bspInfoCpu (VOID)
{
    return  (X86_FEATURE_CPU_INFO);
}
/*********************************************************************************************************
** 函数名称: bspInfoCache
** 功能描述: BSP CACHE 信息
** 输　入  : NONE
** 输　出  : CACHE 信息
** 全局变量:
** 调用模块:
*********************************************************************************************************/
LW_WEAK CPCHAR  bspInfoCache (VOID)
{
    return  (X86_FEATURE_CACHE_INFO);
}
/*********************************************************************************************************
** 函数名称: bspInfoHwcap
** 功能描述: BSP 硬件特性
** 输　入  : NONE
** 输　出  : 硬件特性 (如果支持硬浮点, 可以加入 HWCAP_FPU, HWCAP_MMX, HWCAP_SSE, HWCAP_SSE2, HWCAP_AVX)
** 全局变量:
** 调用模块:
*********************************************************************************************************/
LW_WEAK ULONG  bspInfoHwcap (VOID)
{
    ULONG  ulHwcap = 0;

    if (X86_FEATURE_HAS_X87FPU) {
        ulHwcap |= HWCAP_FPU;
    }

    if (X86_FEATURE_HAS_MMX) {
        ulHwcap |= HWCAP_MMX;
    }

    if (X86_FEATURE_HAS_SSE) {
        ulHwcap |= HWCAP_SSE;
    }

    if (X86_FEATURE_HAS_SSE2) {
        ulHwcap |= HWCAP_SSE2;
    }

    if (X86_FEATURE_HAS_AVX) {
        ulHwcap |= HWCAP_AVX;
    }

    return  (ulHwcap);
}
/*********************************************************************************************************
  MMU 相关接口
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspMmuPgdMaxNum
** 功能描述: 获得 PGD 池的数量
** 输  入  : NONE
** 输  出  : PGD 池的数量 (1 个池可映射 4GB 空间, 推荐返回 1)
** 全局变量:
** 调用模块:
*********************************************************************************************************/
LW_WEAK ULONG  bspMmuPgdMaxNum (VOID)
{
    return  (1);
}
/*********************************************************************************************************
** 函数名称: bspMmuPgdMaxNum
** 功能描述: 获得 PTE 池的数量
** 输  入  : NONE
** 输  出  : PTE 池的数量 (映射 4GB 空间, 需要 1024 个 PTE 池)
** 全局变量:
** 调用模块:
*********************************************************************************************************/
LW_WEAK ULONG  bspMmuPteMaxNum (VOID)
{
    return  (1024);
}
/*********************************************************************************************************
  电源相关接口
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspResetByKeyboard
** 功能描述: 通过键盘重新启动
** 输　入  : NONE
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
static VOID  bspResetByKeyboard (VOID)
{
    INT     i;
    UINT8   ucTemp;

    /*
     * Clear all keyboard buffers (output and command buffers)
     */
    do {
        ucTemp = in8(STATUS_8042);
        if (ucTemp & KBD_KDIB) {                                        /*  Empty keyboard data         */
            in8(DATA_8042);
        }
    } while (ucTemp & KBD_UDIB);                                        /*  Empty user data             */

    for (i = 0; i < 10; i++) {
        out8(KBD_RESET, STATUS_8042);                                   /*  Pulse CPU reset line        */
        bspDelayUs(50);
    }

    while (1) {
        X86_HLT();
    }
}
/*********************************************************************************************************
** 函数名称: bspReboot
** 功能描述: 系统重新启动
** 输　入  : iRebootType       重启类型
**           ulStartAddress    启动开始地址
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
LW_WEAK VOID  bspReboot (INT  iRebootType, addr_t  ulStartAddress)
{
    (VOID)iRebootType;
    (VOID)ulStartAddress;

    if (x86AcpiAvailable()) {                                           /*  ACPI 可用                   */
        if (iRebootType == LW_REBOOT_SHUTDOWN) {                        /*  关机的重启类型              */
            AcpiEnterSleepStatePrep(ACPI_STATE_S5);
            AcpiEnterSleepState(ACPI_STATE_S5);                         /*  连电源在内的所有设备全部关闭*/

        } else {
            AcpiReset();                                                /*  ACPI 重启                   */
        }
        bspResetByKeyboard();                                           /*  上面失败了，使用键盘重启    */

    } else {
        bspResetByKeyboard();                                           /*  ACPI 不可用，使用键盘重启   */
    }
}
/*********************************************************************************************************
** 函数名称: bspDelay720Ns
** 功能描述: 延迟 720 纳秒
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspDelay720Ns (VOID)
{
    CHAR  cTemp __unused;

    cTemp = in8(UNUSED_ISA_IO_ADDRESS);                                 /*  消耗 720 NS                 */
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
