/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: pinConfig.h
**
** 创   建   人: Wang.Xuan (王翾)
**
** 文件创建日期: 2019 年 08 月 12 日
**
** 描        述: pinctrl 子系统中的引脚配置实现
*********************************************************************************************************/

#ifndef __PINCONFIG_H
#define __PINCONFIG_H

/*********************************************************************************************************
  裁剪宏
*********************************************************************************************************/
#if (LW_CFG_DEVICE_EN > 0) && (LW_CFG_DEVTREE_EN > 0)

/*********************************************************************************************************
  引脚配置参数
*********************************************************************************************************/

typedef enum {
    PIN_CONFIG_BIAS_PULL_DOWN,                                          /*  引脚被下拉                  */
    PIN_CONFIG_BIAS_PULL_PIN_DEFAULT,                                   /*  引脚为硬件默认状态          */
    PIN_CONFIG_BIAS_PULL_UP,                                            /*  引脚被上拉                  */
    PIN_CONFIG_DRIVE_STRENGTH,                                          /*  引脚上拉能力                */
    PIN_CONFIG_OUTPUT,                                                  /*  引脚输出                    */
    PIN_CONFIG_END = 0x7f,
    PIN_CONFIG_MAX = 0xff,
} PIN_CONFIG_PARAM;

/*********************************************************************************************************
  引脚配置与 CONFIG 变量转换

  +--------------------------+--------+
  | 31                     8 | 7    0 |
  +--------+--------+--------+--------+
  |         Argument         |  Param |
  +--------+--------+--------+--------+

*********************************************************************************************************/

#define PINCONF_TO_CONFIG_PARAM(ulConfig)      (PIN_CONFIG_PARAM)(ulConfig & 0xfful)
#define PINCONF_TO_CONFIG_ARGUMENT(ulConfig)   (UINT32)((ulConfig >> 8) & 0xfffffful)
#define PINCONF_PACKED(pin, conf)              (((conf) << 8) | ((ULONG)pin & 0xfful))

/*********************************************************************************************************
  引脚配置接口实现
*********************************************************************************************************/

LW_API INT   API_PinConfigApply(PLW_PINCTRL_SETTING  ppinctrlsetting);

LW_API INT   API_PinConfigMapToSetting(PLW_PINCTRL_MAP      ppinctrlmap,
                                       PLW_PINCTRL_SETTING  ppinctrlsetting);

LW_API INT   API_PinConfigMapValidate(PLW_PINCTRL_MAP  ppinctrlmap, INT  i);

#endif                                                                  /*  (LW_CFG_DEVICE_EN > 0) &&   */
                                                                        /*  (LW_CFG_DEVTREE_EN > 0)     */
#endif                                                                  /*  __PINCONFIG_H               */
/*********************************************************************************************************
  END
*********************************************************************************************************/
