/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: vutex.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2020 年 12 月 26 日
**
** 描        述: 等待变量锁.
*********************************************************************************************************/

#ifndef __VUTEX_H
#define __VUTEX_H

/*********************************************************************************************************
  API

  只有 iFlags 相同, 才表示同一变量,
  仅对进程内多任务生效, 可以使用 LW_OPTION_VUTEX_LOCAL, Vutex 工作速度快, 不进行地址映射转换.
  对整个系统生效, 可以使用 LW_OPTION_VUTEX_GLOBAL, Vutex 将保存对应的物理地址关系, 可跨进程等待.
*********************************************************************************************************/

LW_API INT  API_VutexPend(INT  *piVar, INT  iExpect, INT  iFlags, ULONG  ulTimeout);
LW_API INT  API_VutexPost(INT  *piVar, INT  iValue, INT  iFlags);

#endif                                                                  /*  __VUTEX_H                   */
/*********************************************************************************************************
  END
*********************************************************************************************************/
